{
  "decks": [
    {
      "id": 1,
      "name": "Tutorial",
      "description": "A tutorial / walk through of the website and its functions. For best experience, click 'Study' to go through tutorial in 'Study Mode'."
    }
  ],
  "cards": [
    {
      "id": 1,
      "front": "Create Deck",
      "back": "You are provided with two text input boxes. •Name• -This will be the name you assign your new Deck. e.g 'Biology101-Chapter1-Key Terms' •Description• -Here you can input the desired description of your new Deck. e.g 'This Deck consists of all the key terms assigned for memorization by Professor Johnson.' Once complete click •Submit•",
      "deckId": 1
    },
    {
      "id": 2,
      "front": "View Deck",
      "back": "When clicked this will expand the entire deck displaying the front and backside of all cards within the deck, with the options to •Delete• | •Study• | •Add Cards• | •Edit• all displayed by their respective buttons.",
      "deckId": 1
    },
    {
      "id": 3,
      "front": "Edit(Deck)",
      "back": "After selecting •View• on a desired deck, you will be presented with a button labeled •Edit•. Clicking Edit enables you to make any alterations necessary to the Name and Description of your Deck.",
      "deckId": 1
    },
    {
      "front": "Study",
      "back": "After a deck has accumulated 3 or more flashcards the option to study the deck will be made available. Once clicked it will display the front side(name) of the first card. A button labeled •Flip• to switch the card over to the backside(Description) which will then be displayed. You can continue the same card until confident in moving on by clicking •Next• which will move you onto the next card in the Deck. When you reach the end of the Deck and you click •Next• a dialog box stating 'Click Ok' to restart at the beginning of the Deck, or click cancel to return to the websites Dashboard.",
      "deckId": 1,
      "id": 4
    },
    {
      "front": "Add Cards",
      "back": "After selecting •View• on a desired deck, you will be presented with a button labeled •Add Cards•. Clicking Add Cards enables you to add new cards to the deck. You are provided with two text input boxes. •Front• -This will be the name you assign your new card. e.g 'Mitochondria' •Back• -Here you can input the desired description of your new card. e.g 'The powerhouse of the cell.' Once complete click •Submit•",
      "deckId": 1,
      "id": 5
    },
    {
      "front": "Delete",
      "back": "After selecting •View• on a desired deck, you will be presented with a button labeled •Delete•. Clicking Delete will remove the deck from the website.",
      "deckId": 1,
      "id": 6
    }   
  ]
}
